Revit 2027 API
BuiltInFailures.SketchFailures.RunInvalidSketch Property
 Invalid sketch, can't create run by this sketch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunInvalidSketch { get; }
Public Shared ReadOnly Property RunInvalidSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunInvalidSketch {
	FailureDefinitionId^ get ();
}
static member RunInvalidSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace